EDT/УТ/src/Documents/новаНазначениеПоказателейРасчетаНачислений/новаНазначениеПоказателейРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаНазначениеПоказателейРасчетаНачислений</name>
  <registerRecords>InformationRegister.новаЗначенияПоказателейРасчетаНачислений</registerRecords>
  <attributes>
    <name>ДатаНазначения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.новаПоказателиРасчетаНачислений</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/новаЗначенияПоказателейРасчетаНачислений/новаЗначенияПоказателейРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗначенияПоказателейРасчетаНачислений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.новаПоказателиРасчетаНачислений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/новаНазначениеПоказателейРасчетаНачислений/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДатаНазначения) Тогда
		Сообщить("Не указана дата назначения!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого стрПоказатель Из Показатели Цикл
		Если Не ЗначениеЗаполнено(стрПоказатель.Показатель) Тогда
			Сообщить("Строка " + Строка(стрПоказатель.НомерСтроки) + ": не заполнен показатель!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.новаЗначенияПоказателейРасчетаНачислений.Добавить();
		Движение.Период = ДатаНазначения;
		ЗаполнитьЗначенияСвойств(Движение, стрПоказатель);
	КонецЦикла;
КонецПроцедуры
